{
  "session_id": "2025-11-04_01-39-49",
  "session_start": "2025-11-04T01:39:49.389078",
  "session_duration_seconds": 3.358728,
  "pdf_context": "Graphical Abstract Rolling EPWs - Observation-based statistical framework of climate-model-informed EPWs Hongshan Guo Highlights Rolling EPWs - Observation-based statistical framework of climate-model-informed EPWs Hongshan Guo •Research highlight 1 •Research highlight 2 Rolling EPWs - Observation-based statistical framework of climate-model-informed EPWs Hongshan Guo Department of Architecture, The University of Hong Kong, Hong Kong SAR, China Abstract Abstract text. Keywords: 1. Introduction Hot extremes and multi-day heatwaves are increasing in frequency, intensity, and per- sistence as the planet warms; even small increments in global mean temperature yield dis- cernible increases in hot-extreme occurrence and severity [1, 2]. For building resilience, the critical question is not performance under an average future slice, but whena design fails under plausible future sequences . We learn sub-daily structure from in-situ station observations via NOAA’s Integrated Surface Database (ISD) [3, 4]. Because the backbone network (ASOS/AWOS) is primarily at airports embedded in urban fabrics, these data offer city-proximal exposure compared with coarse reanalyses [5, 6]. Representativeness and siting follow the Local Climate Zones framework and canonical urban heat-island physics [7, 8]. Future daily-scale signals come from CORDEX, linked to CMIP and designed for im- pacts/adaptation [9, 10]. We adopt these day-by-day signals so that trends and event timing (e.g., hot-spell onset/persistence) are scenario-faithful. Typical-yearweatherfiles(TMY/TWY;IWEC2)smoothextremesandbreakpersistence [11, 12, 13]. Comparative analyses and assessments show material discrepancies versus multi-year actual weather (AWY/AMY) across climates and typologies [14, 15, 16]. Recent community resources (IEA EBC Annex 80) package future TMYs and explicit heat-wave years (HWYs) with multi-year projections [17], which lowers barriers but still emphasizes selected years rather than time-continuous, probability-aware futures. Trend-preserving quantile approaches such as QDM retain projected changes [18], while multivariatemethodssuchasMBCnextendbiascorrectiontojointdistributions[19]; reviews attest to their maturity [20]. Morphing methods are practical for average slices but cannot capture evolving persistence/compound extremes [21]. Most “future weather” workflows in buildings and the grid adopt time-slice files (e.g., 2030s/2050s/2080s) generated by morph- ing or generator approaches. In practice, designers use CIBSE [22] TRY/DSY sets for spe- cific horizons (e.g., TM49 for London[23]) or commercial datasets such as WeatherShift[24]; at the tool level, CCWorldWeatherGen and newer generators operationalize the classic Belcher–Hacker–Powell morphing method [25, 26, 27]. These pipelines doreflect climatologi- calshifts,buttheytypicallyapply delta-change adjustments tohistoricalseries(means/variances, sometimes quantiles) and deliver only a few representative years per horizon rather than a continuous time series—so they can weaken day-to-day joint variability (e.g., Ta–RH–wind covariation), extreme-event continuity, and regime persistence in long stress tests [28, 29]. Our contribution is a year-by-year sAMY sequence (2025–2095) that is GCM/RCM- anchored and bias-corrected to preserve diurnal shape and extreme-event structure, then used tofreeze 2021 capacities and trace energy, comfort, and system-failure regimes con- tinuously. This complements morphing-based tools (e.g., epwshiftr ) and curated future- weather sets from Annex 80 (typical and extreme years for discrete horizons) by adding a continuous timeline and a mechanistic failure analysis (coil-capacity vs controller-struggle) that three-slice workflows cannot expose [30, 31]. We treat future weather as an observation-informed, scenario-conditioned stochastic pro- cess. Concretely, we (i) lock daily means to CORDEX so that trends and event timing",
  "pdf_metadata": {
    "title": "Unknown",
    "author": "Unknown",
    "pages": 33,
    "filename": "sAMY.pdf"
  },
  "conversation": [
    {
      "timestamp": "2025-11-04T01:39:52.747793",
      "speaker": "bot",
      "text": "Dear author,\n\nThank you for sharing your essay with me. I'm excited to engage with your ideas and explore the nuances of climate-model-informed EPWs. To get started, could you please summarize your main thesis or central argument in your own words? What's the core claim or insight that drives your analysis?\n\nLooking forward to reading more!"
    }
  ],
  "message_count": 1,
  "student_messages": 0,
  "bot_messages": 1
}